import Image from 'next/image'
import React from 'react'

function Featured() {
  return (
    <div className="flex gap-6 flex-col">
      <h1 className="text-5xl tracking-wide leading-tight font-bold">
        وب اپلیکیشن بلاگ نویسی کد نویسی شده به زبان Next.js با اتصال به دیتابیس
        MongoDB
      </h1>
      <div className="flex flex-col-reverse md:flex-row gap-3 items-center">
        <div className="flex md:flex-1 flex-col justify-center p-4 gap-2">
          <h2 className="text-xl font-semibold">به راحتی بنویسید</h2>
          <p className='font-light text-[var(--softTextColor)]'>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
            در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
            می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این
            صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
            شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای
            اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
            استفاده قرار گیرد.
          </p>
          <p className='font-light text-[var(--softTextColor)]'>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
            در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
            می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این
            صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
            شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای
            اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
            استفاده قرار گیرد.
          </p>
          <button className="px-5 py-4 rounded-xl self-end bg-[var(--textColor)] text-[var(--bg)]">
            بیشتر
          </button>
        </div>
        <div className='md:flex-1 min-h-[300px] w-full relative'>
          <Image
            src={"/images/root/featured.webp"}
            alt="قابلیت ها"
            fill
            className="object-cover"
          />
        </div>
      </div>
    </div>
  );
}

export default Featured